## Pandas Introduction for Data Science

In [7]:
import numpy as np
import pandas as pd

### Series

In [9]:
s = ([1, np.nan, ' Pandas Library '])
s1 = pd.Series(s)
s1

0                   1
1                 NaN
2     Pandas Library
dtype: object

In [10]:
s2 = np.array([2, np.nan, 'b'])
s2 = pd.Series(s2)
s2

0      2
1    NaN
2      b
dtype: object

In [11]:
list1 = ['animal', '2', 'animal']
s3 = pd.Series(list1)
s3

0    animal
1         2
2    animal
dtype: object

In [12]:
list2 = [3, 'c', 'Numpy']
s4 = pd.Series(list2)
s4

0        3
1        c
2    Numpy
dtype: object

In [13]:
s5 = pd.Series({'A': 1, '3': 'Python'})
s5

A         1
3    Python
dtype: object

In [14]:
s6 = pd.Series({'Integer': 3, 'B': 'Boys'})
s6

Integer       3
B          Boys
dtype: object

### DataFrames

In [15]:
df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0 -0.807392  2.522331  0.964816 -1.723544
1 -1.608202  1.434673 -0.339957  1.751864
2  0.817009  1.112003 -0.393130 -1.079374
3 -0.983565  0.316552 -0.990568 -0.406979
4  1.718572  0.187189 -1.531126 -1.496753
5  0.295776  0.312929  1.264758 -0.061004

In [18]:
df1 = pd.DataFrame(np.random.randn(3, 3))
df1

          0         1         2
0 -0.442093  0.098585 -1.089166
1  1.200347 -1.145820  1.304990
2 -1.664482 -1.266947  0.040454

In [19]:
df2 = pd.DataFrame({
    'A': 1,
    'number': np.array([6] * 3, dtype='int32')
})
df2

   A  number
0  1       6
1  1       6
2  1       6

In [20]:
df3 = pd.DataFrame({
    'E': np.array([4] * 5, dtype='int32'),
    'Day': 2
})
df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2